In [1]:
%%capture

!pip install ipython-sql
!pip install databases
!pip install databases[sqlite]

In [2]:
import sqlalchemy
%load_ext sql
%sql sqlite:///projectdb.db

'Connected: @projectdb.db'

In [6]:
%%sql

DROP TABLE IF EXISTS [system];
CREATE TABLE [system] (
  [ID] INTEGER PRIMARY KEY,
  [System] nvarchar(250) NOT NULL
);

DROP TABLE IF EXISTS [VisitorStatus];
CREATE TABLE [VisitorStatus] (
  [ID] INTEGER PRIMARY KEY,
  [status] nvarchar(250) NOT NULL
);

DROP TABLE IF EXISTS [item];
CREATE TABLE [item] (
  [ID] INTEGER PRIMARY KEY,
  [Item] nvarchar(250) NOT NULL,
  [Price] float NOT NULL,
  [Stock] int,
  [systemID] int,
  FOREIGN KEY ([systemID]) REFERENCES [system]([ID])
);

DROP TABLE IF EXISTS [cart];
CREATE TABLE [cart] (
  [ID] INTEGER PRIMARY KEY,
  [itemID] int,
  [systemID] int,
  FOREIGN KEY ([itemID]) REFERENCES [item]([ID]) ON DELETE SET NULL,
  FOREIGN KEY ([systemID]) REFERENCES [system]([ID]) ON DELETE SET NULL
);

DROP TABLE IF EXISTS [visitor];
CREATE TABLE [visitor] (
  [ID] INTEGER PRIMARY KEY,
  [VisitorStatusID] int,
  [cartID] int,
  FOREIGN KEY ([VisitorStatusID]) REFERENCES [VisitorStatus]([ID]) ON DELETE SET NULL,
  FOREIGN KEY ([cartID]) REFERENCES [cart]([ID]) ON DELETE SET NULL
);

DROP TABLE IF EXISTS [deals];
CREATE TABLE [deals] (
  [ID] INTEGER PRIMARY KEY,
  [itemID] int,
  [start] nvarchar(250) NOT NULL,
  [end] nvarchar(250) NOT NULL,
  [savings] nvarchar(250) NOT NULL,
  FOREIGN KEY ([itemID]) REFERENCES [item]([ID]) ON DELETE SET NULL
);

DROP TABLE IF EXISTS [payment];
CREATE TABLE [payment] (
  [ID] INTEGER PRIMARY KEY,
  [cardName] nvarchar(250) NOT NULL,
  [cardNumber] nvarchar(250) NOT NULL,
  [cardExpDate] nvarchar(250) NOT NULL,
  [cardCSV] nvarchar(250) NOT NULL
);

DROP TABLE IF EXISTS [PreviousOrder];
CREATE TABLE [PreviousOrder] (
  [ID] INTEGER PRIMARY KEY,
  [item1ID] int,
  [item2ID] int,
  [item3ID] int,
  [item4ID] int,
  FOREIGN KEY ([item1ID]) REFERENCES [item]([ID]) ON DELETE SET NULL,
  FOREIGN KEY ([item2ID]) REFERENCES [item]([ID]) ON DELETE SET NULL,
  FOREIGN KEY ([item3ID]) REFERENCES [item]([ID]) ON DELETE SET NULL,
  FOREIGN KEY ([item4ID]) REFERENCES [item]([ID]) ON DELETE SET NULL
);

DROP TABLE IF EXISTS [account];
CREATE TABLE [account] (
  [ID] INTEGER PRIMARY KEY,
  [accountName] nvarchar(250) NOT NULL,
  [accountEmail] nvarchar(250) NOT NULL,
  [accountPaymentID] int,
  [PreviousOrderID] int,
  FOREIGN KEY ([accountPaymentID]) REFERENCES [payment]([ID]) ON DELETE SET NULL,
  FOREIGN KEY ([PreviousOrderID]) REFERENCES [PreviousOrder]([ID]) ON DELETE SET NULL
  );

  DROP TABLE IF EXISTS [associate];
  CREATE TABLE [associate] (
    [ID] INTEGER PRIMARY KEY,
    [email] nvarchar(250) NOT NULL,
    [name] nvarchar(250) NOT NULL
  );

  DROP TABLE IF EXISTS [CustomerService];
  CREATE TABLE [CustomerService] (
    [ID] INTEGER PRIMARY KEY,
    [csPhone] nvarchar(250) NOT NULL,
    [csEmail] nvarchar(250) NOT NULL,
    [csAssociateID] int,
    FOREIGN KEY ([csAssociateID]) REFERENCES [associate]([ID]) ON DELETE SET NULL
  );

  DROP TABLE IF EXISTS [Amazon];
  CREATE TABLE [Amazon] (
    [HelpCenter] nvarchar NOT NULL,
    [Accessibility] nvarchar NOT NULL,
    [Prime] nvarchar NOT NULL,
    [CustomerServiceID] int,
    FOREIGN KEY ([CustomerServiceID]) REFERENCES [CustomerService]([ID]) ON DELETE SET NULL
  );

 * sqlite:///projectdb.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [5]:
%%sql

PRAGMA foreign_keys;

 * sqlite:///projectdb.db
Done.

[(1,)]

In [4]:
%%sql

PRAGMA foreign_keys = ON;

 * sqlite:///projectdb.db
Done.

[]

In [7]:
print('system')
%sql pragma table_info('system');

system
 * sqlite:///projectdb.db
Done.

[(0, 'ID', 'INTEGER', 0, None, 1), (1, 'System', 'nvarchar(250)', 1, None, 0)]

In [8]:
print('VisitorStatus')
%sql pragma table_info('VisitorStatus');

VisitorStatus
 * sqlite:///projectdb.db
Done.

[(0, 'ID', 'INTEGER', 0, None, 1), (1, 'status', 'nvarchar(250)', 1, None, 0)]

In [9]:
print('item')
%sql pragma table_info('item');

item
 * sqlite:///projectdb.db
Done.

[(0, 'ID', 'INTEGER', 0, None, 1),
 (1, 'Item', 'nvarchar(250)', 1, None, 0),
 (2, 'Price', 'float', 1, None, 0),
 (3, 'Stock', 'int', 0, None, 0),
 (4, 'systemID', 'int', 0, None, 0)]

In [10]:
print('cart')
%sql pragma table_info('cart');

cart
 * sqlite:///projectdb.db
Done.

[(0, 'ID', 'INTEGER', 0, None, 1),
 (1, 'itemID', 'int', 0, None, 0),
 (2, 'systemID', 'int', 0, None, 0)]

In [11]:
print('visitor')
%sql pragma table_info('visitor');

visitor
 * sqlite:///projectdb.db
Done.

[(0, 'ID', 'INTEGER', 0, None, 1),
 (1, 'VisitorStatusID', 'int', 0, None, 0),
 (2, 'cartID', 'int', 0, None, 0)]

In [12]:
print('deals')
%sql pragma table_info('deals');

deals
 * sqlite:///projectdb.db
Done.

[(0, 'ID', 'INTEGER', 0, None, 1),
 (1, 'itemID', 'int', 0, None, 0),
 (2, 'start', 'nvarchar(250)', 1, None, 0),
 (3, 'end', 'nvarchar(250)', 1, None, 0),
 (4, 'savings', 'nvarchar(250)', 1, None, 0)]

In [13]:
print('payment')
%sql pragma table_info('payment');

payment
 * sqlite:///projectdb.db
Done.

[(0, 'ID', 'INTEGER', 0, None, 1),
 (1, 'cardName', 'nvarchar(250)', 1, None, 0),
 (2, 'cardNumber', 'nvarchar(250)', 1, None, 0),
 (3, 'cardExpDate', 'nvarchar(250)', 1, None, 0),
 (4, 'cardCSV', 'nvarchar(250)', 1, None, 0)]

In [14]:
print('PreviousOrder')
%sql pragma table_info('PreviousOrder');

PreviousOrder
 * sqlite:///projectdb.db
Done.

[(0, 'ID', 'INTEGER', 0, None, 1),
 (1, 'item1ID', 'int', 0, None, 0),
 (2, 'item2ID', 'int', 0, None, 0),
 (3, 'item3ID', 'int', 0, None, 0),
 (4, 'item4ID', 'int', 0, None, 0)]

In [15]:
print('account')
%sql pragma table_info('account');

account
 * sqlite:///projectdb.db
Done.

[(0, 'ID', 'INTEGER', 0, None, 1),
 (1, 'accountName', 'nvarchar(250)', 1, None, 0),
 (2, 'accountEmail', 'nvarchar(250)', 1, None, 0),
 (3, 'accountPaymentID', 'int', 0, None, 0),
 (4, 'PreviousOrderID', 'int', 0, None, 0)]

In [16]:
print('associate')
%sql pragma table_info('associate');

associate
 * sqlite:///projectdb.db
Done.

[(0, 'ID', 'INTEGER', 0, None, 1),
 (1, 'email', 'nvarchar(250)', 1, None, 0),
 (2, 'name', 'nvarchar(250)', 1, None, 0)]

In [17]:
print('CustomerService')
%sql pragma table_info('CustomerService');

CustomerService
 * sqlite:///projectdb.db
Done.

[(0, 'ID', 'INTEGER', 0, None, 1),
 (1, 'csPhone', 'nvarchar(250)', 1, None, 0),
 (2, 'csEmail', 'nvarchar(250)', 1, None, 0),
 (3, 'csAssociateID', 'int', 0, None, 0)]

In [18]:
print('Amazon')
%sql pragma table_info('Amazon');

Amazon
 * sqlite:///projectdb.db
Done.

[(0, 'HelpCenter', 'nvarchar', 1, None, 0),
 (1, 'Accessibility', 'nvarchar', 1, None, 0),
 (2, 'Prime', 'nvarchar', 1, None, 0),
 (3, 'CustomerServiceID', 'int', 0, None, 0)]

In [19]:
%%sql

INSERT INTO system([System]) VALUES ("PlayStation 5");
INSERT INTO system([System]) VALUES ("PlayStation 4");
INSERT INTO system([System]) VALUES ("Xbox Series X & S");
INSERT INTO system([System]) VALUES ("Xbox One");
INSERT INTO system([System]) VALUES ("Nintendo Switch");
INSERT INTO system([System]) VALUES ("PC");
INSERT INTO system([System]) VALUES ("Mac");
INSERT INTO system([System]) VALUES ("Legacy Systems");
INSERT INTO system([System]) VALUES ("Online Gaming Services");
INSERT INTO system([System]) VALUES ("Microconsoles");
INSERT INTO system([System]) VALUES ("Virtual Reality");

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [20]:
%%sql

SELECT *
FROM system;

 * sqlite:///projectdb.db
Done.

[(1, 'PlayStation 5'),
 (2, 'PlayStation 4'),
 (3, 'Xbox Series X & S'),
 (4, 'Xbox One'),
 (5, 'Nintendo Switch'),
 (6, 'PC'),
 (7, 'Mac'),
 (8, 'Legacy Systems'),
 (9, 'Online Gaming Services'),
 (10, 'Microconsoles'),
 (11, 'Virtual Reality')]

In [21]:
%%sql

INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("Headset", 149.95, 20, 1);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("Controller", 74.00, 43, 1);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("PlayStation 4 Console", 199.99, 112, 2);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("Game Disk", 39.95, 4, 2);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("Currency Card", 29.95, 93, 3);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("Charging Cable", 9.99, 254, 3);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("Driving Wheel", 279.03, 2, 4);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("Controller Charging Station", 22.99, 31, 4);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("EShop Gift Card", 5.00, 55, 5);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("Pro Controller", 69.99, 77, 5);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("Keyboard", 138.99, 1, 6);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("Mouse", 11.89, 13, 6);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("Apple Keyboard", 129.99, 43, 7);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("External Port Adapter", 55.99, 92, 7);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("Xbox 360 Controller", 29.99, 14, 8);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("PlayStation 3 Console", 99.99, 24, 8);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("PlayStation Store Credit", 75.00, 69, 9);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("Universal TV Remote", 13.98, 81, 10);
INSERT INTO item([Item],[Price],[Stock],[systemID]) VALUES ("Virtual Reality Headset", 399.99, 6, 11);

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [22]:
%%sql

SELECT * FROM item;

 * sqlite:///projectdb.db
Done.

[(1, 'Headset', 149.95, 20, 1),
 (2, 'Controller', 74.0, 43, 1),
 (3, 'PlayStation 4 Console', 199.99, 112, 2),
 (4, 'Game Disk', 39.95, 4, 2),
 (5, 'Currency Card', 29.95, 93, 3),
 (6, 'Charging Cable', 9.99, 254, 3),
 (7, 'Driving Wheel', 279.03, 2, 4),
 (8, 'Controller Charging Station', 22.99, 31, 4),
 (9, 'EShop Gift Card', 5.0, 55, 5),
 (10, 'Pro Controller', 69.99, 77, 5),
 (11, 'Keyboard', 138.99, 1, 6),
 (12, 'Mouse', 11.89, 13, 6),
 (13, 'Apple Keyboard', 129.99, 43, 7),
 (14, 'External Port Adapter', 55.99, 92, 7),
 (15, 'Xbox 360 Controller', 29.99, 14, 8),
 (16, 'PlayStation 3 Console', 99.99, 24, 8),
 (17, 'PlayStation Store Credit', 75.0, 69, 9),
 (18, 'Universal TV Remote', 13.98, 81, 10),
 (19, 'Virtual Reality Headset', 399.99, 6, 11)]

In [23]:
%%sql 

INSERT INTO VisitorStatus([Status]) VALUES ('Member');
INSERT INTO VisitorStatus([Status]) VALUES ('Visitor');

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.

[]

In [24]:
%%sql

SELECT * FROM VisitorStatus;

 * sqlite:///projectdb.db
Done.

[(1, 'Member'), (2, 'Visitor')]

In [25]:
%%sql

INSERT INTO cart([itemID],[systemID]) VALUES (1,1);
INSERT INTO cart([itemID],[systemID]) VALUES (2,1);
INSERT INTO cart([itemID],[systemID]) VALUES (3,2);
INSERT INTO cart([itemID],[systemID]) VALUES (4,2);
INSERT INTO cart([itemID],[systemID]) VALUES (5,3);
INSERT INTO cart([itemID],[systemID]) VALUES (6,3);
INSERT INTO cart([itemID],[systemID]) VALUES (7,4);
INSERT INTO cart([itemID],[systemID]) VALUES (8,4);
INSERT INTO cart([itemID],[systemID]) VALUES (9,5);
INSERT INTO cart([itemID],[systemID]) VALUES (10,5);
INSERT INTO cart([itemID],[systemID]) VALUES (11,6);
INSERT INTO cart([itemID],[systemID]) VALUES (12,6);

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [26]:
%%sql

SELECT * FROM cart;

 * sqlite:///projectdb.db
Done.

[(1, 1, 1),
 (2, 2, 1),
 (3, 3, 2),
 (4, 4, 2),
 (5, 5, 3),
 (6, 6, 3),
 (7, 7, 4),
 (8, 8, 4),
 (9, 9, 5),
 (10, 10, 5),
 (11, 11, 6),
 (12, 12, 6)]

In [27]:
%%sql

INSERT INTO visitor([cartID],[VisitorStatusID]) VALUES (1,1);
INSERT INTO visitor([cartID],[VisitorStatusID]) VALUES (2,1);
INSERT INTO visitor([cartID],[VisitorStatusID]) VALUES (3,2);
INSERT INTO visitor([cartID],[VisitorStatusID]) VALUES (4,1);
INSERT INTO visitor([cartID],[VisitorStatusID]) VALUES (5,2);
INSERT INTO visitor([cartID],[VisitorStatusID]) VALUES (6,2);
INSERT INTO visitor([cartID],[VisitorStatusID]) VALUES (7,2);
INSERT INTO visitor([cartID],[VisitorStatusID]) VALUES (8,1);
INSERT INTO visitor([cartID],[VisitorStatusID]) VALUES (9,1);
INSERT INTO visitor([cartID],[VisitorStatusID]) VALUES (10,2);
INSERT INTO visitor([cartID],[VisitorStatusID]) VALUES (11,1);
INSERT INTO visitor([cartID],[VisitorStatusID]) VALUES (12,2);

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [28]:
%%sql

SELECT * FROM visitor;

 * sqlite:///projectdb.db
Done.

[(1, 1, 1),
 (2, 1, 2),
 (3, 2, 3),
 (4, 1, 4),
 (5, 2, 5),
 (6, 2, 6),
 (7, 2, 7),
 (8, 1, 8),
 (9, 1, 9),
 (10, 2, 10),
 (11, 1, 11),
 (12, 2, 12)]

In [29]:
%%sql

INSERT INTO deals([itemID],[start],[end],[savings]) VALUES (1,"2022-2-14",date(),"20%");
INSERT INTO deals([itemID],[start],[end],[savings]) VALUES (2,date(),date(),"10%");
INSERT INTO deals([itemID],[start],[end],[savings]) VALUES (3,date(),date(),"5%");
INSERT INTO deals([itemID],[start],[end],[savings]) VALUES (4,date(),date(),"8%");
INSERT INTO deals([itemID],[start],[end],[savings]) VALUES (5,date(),date(),"12%");
INSERT INTO deals([itemID],[start],[end],[savings]) VALUES (6,date(),date(),"25%");
INSERT INTO deals([itemID],[start],[end],[savings]) VALUES (7,date(),date(),"50%");
INSERT INTO deals([itemID],[start],[end],[savings]) VALUES (8,date(),date(),"60%");
INSERT INTO deals([itemID],[start],[end],[savings]) VALUES (9,date(),date(),"15%");
INSERT INTO deals([itemID],[start],[end],[savings]) VALUES (10,date(),date(),"22%");
INSERT INTO deals([itemID],[start],[end],[savings]) VALUES (11,date(),date(),"30%");
INSERT INTO deals([itemID],[start],[end],[savings]) VALUES (12,date(),date(),"40%");

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [30]:
%%sql

SELECT * FROM deals;

 * sqlite:///projectdb.db
Done.

[(1, 1, '2022-2-14', '2022-04-04', '20%'),
 (2, 2, '2022-04-04', '2022-04-04', '10%'),
 (3, 3, '2022-04-04', '2022-04-04', '5%'),
 (4, 4, '2022-04-04', '2022-04-04', '8%'),
 (5, 5, '2022-04-04', '2022-04-04', '12%'),
 (6, 6, '2022-04-04', '2022-04-04', '25%'),
 (7, 7, '2022-04-04', '2022-04-04', '50%'),
 (8, 8, '2022-04-04', '2022-04-04', '60%'),
 (9, 9, '2022-04-04', '2022-04-04', '15%'),
 (10, 10, '2022-04-04', '2022-04-04', '22%'),
 (11, 11, '2022-04-04', '2022-04-04', '30%'),
 (12, 12, '2022-04-04', '2022-04-04', '40%')]

In [31]:
%%sql

INSERT INTO payment([cardName],[cardNumber],[cardExpDate],[cardCSV]) VALUES ("Bill","111111111111","01/22","111");
INSERT INTO payment([cardName],[cardNumber],[cardExpDate],[cardCSV]) VALUES ("Will","222222222222","02/22","222");
INSERT INTO payment([cardName],[cardNumber],[cardExpDate],[cardCSV]) VALUES ("Jill","333333333333","03/22","333");
INSERT INTO payment([cardName],[cardNumber],[cardExpDate],[cardCSV]) VALUES ("William","444444444444","04/22","444");
INSERT INTO payment([cardName],[cardNumber],[cardExpDate],[cardCSV]) VALUES ("Dale","555555555555","05/22","555");
INSERT INTO payment([cardName],[cardNumber],[cardExpDate],[cardCSV]) VALUES ("Bale","666666666666","06/22","666");
INSERT INTO payment([cardName],[cardNumber],[cardExpDate],[cardCSV]) VALUES ("Jim","777777777777","07/22","777");
INSERT INTO payment([cardName],[cardNumber],[cardExpDate],[cardCSV]) VALUES ("Dave","888888888888","08/22","888");
INSERT INTO payment([cardName],[cardNumber],[cardExpDate],[cardCSV]) VALUES ("Katy","999999999999","09/22","999");
INSERT INTO payment([cardName],[cardNumber],[cardExpDate],[cardCSV]) VALUES ("Zoey","101010101010","10/22","101");
INSERT INTO payment([cardName],[cardNumber],[cardExpDate],[cardCSV]) VALUES ("Cole","110110110110","11/22","112");
INSERT INTO payment([cardName],[cardNumber],[cardExpDate],[cardCSV]) VALUES ("Chloe","121212121212","12/22","121");

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [32]:
%%sql

SELECT * FROM payment;

 * sqlite:///projectdb.db
Done.

[(1, 'Bill', '111111111111', '01/22', '111'),
 (2, 'Will', '222222222222', '02/22', '222'),
 (3, 'Jill', '333333333333', '03/22', '333'),
 (4, 'William', '444444444444', '04/22', '444'),
 (5, 'Dale', '555555555555', '05/22', '555'),
 (6, 'Bale', '666666666666', '06/22', '666'),
 (7, 'Jim', '777777777777', '07/22', '777'),
 (8, 'Dave', '888888888888', '08/22', '888'),
 (9, 'Katy', '999999999999', '09/22', '999'),
 (10, 'Zoey', '101010101010', '10/22', '101'),
 (11, 'Cole', '110110110110', '11/22', '112'),
 (12, 'Chloe', '121212121212', '12/22', '121')]

In [33]:
%%sql

INSERT INTO PreviousOrder([item1ID],[item2ID],[item3ID],[item4ID]) VALUES (1,1,1,1);
INSERT INTO PreviousOrder([item1ID],[item2ID],[item3ID],[item4ID]) VALUES (2,2,2,2);
INSERT INTO PreviousOrder([item1ID],[item2ID],[item3ID],[item4ID]) VALUES (3,3,3,3);
INSERT INTO PreviousOrder([item1ID],[item2ID],[item3ID],[item4ID]) VALUES (4,4,4,4);
INSERT INTO PreviousOrder([item1ID],[item2ID],[item3ID],[item4ID]) VALUES (5,5,5,5);
INSERT INTO PreviousOrder([item1ID],[item2ID],[item3ID],[item4ID]) VALUES (6,6,6,6);
INSERT INTO PreviousOrder([item1ID],[item2ID],[item3ID],[item4ID]) VALUES (7,7,7,7);
INSERT INTO PreviousOrder([item1ID],[item2ID],[item3ID],[item4ID]) VALUES (8,8,8,8);
INSERT INTO PreviousOrder([item1ID],[item2ID],[item3ID],[item4ID]) VALUES (9,9,9,9);
INSERT INTO PreviousOrder([item1ID],[item2ID],[item3ID],[item4ID]) VALUES (10,10,10,10);
INSERT INTO PreviousOrder([item1ID],[item2ID],[item3ID],[item4ID]) VALUES (11,11,11,11);
INSERT INTO PreviousOrder([item1ID],[item2ID],[item3ID],[item4ID]) VALUES (12,12,12,12);

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [34]:
%%sql

SELECT * FROM PreviousOrder;

 * sqlite:///projectdb.db
Done.

[(1, 1, 1, 1, 1),
 (2, 2, 2, 2, 2),
 (3, 3, 3, 3, 3),
 (4, 4, 4, 4, 4),
 (5, 5, 5, 5, 5),
 (6, 6, 6, 6, 6),
 (7, 7, 7, 7, 7),
 (8, 8, 8, 8, 8),
 (9, 9, 9, 9, 9),
 (10, 10, 10, 10, 10),
 (11, 11, 11, 11, 11),
 (12, 12, 12, 12, 12)]

In [35]:
%%sql

INSERT INTO account([accountName],[accountEmail],[accountPaymentID],[PreviousOrderID]) VALUES ("a","a@gmail.com",1,1);
INSERT INTO account([accountName],[accountEmail],[accountPaymentID],[PreviousOrderID]) VALUES ("b","b@gmail.com",2,2);
INSERT INTO account([accountName],[accountEmail],[accountPaymentID],[PreviousOrderID]) VALUES ("c","c@gmail.com",3,3);
INSERT INTO account([accountName],[accountEmail],[accountPaymentID],[PreviousOrderID]) VALUES ("d","d@gmail.com",4,4);
INSERT INTO account([accountName],[accountEmail],[accountPaymentID],[PreviousOrderID]) VALUES ("e","e@gmail.com",5,5);
INSERT INTO account([accountName],[accountEmail],[accountPaymentID],[PreviousOrderID]) VALUES ("f","f@gmail.com",6,6);
INSERT INTO account([accountName],[accountEmail],[accountPaymentID],[PreviousOrderID]) VALUES ("g","g@gmail.com",7,7);
INSERT INTO account([accountName],[accountEmail],[accountPaymentID],[PreviousOrderID]) VALUES ("h","h@gmail.com",8,8);
INSERT INTO account([accountName],[accountEmail],[accountPaymentID],[PreviousOrderID]) VALUES ("i","i@gmail.com",9,9);
INSERT INTO account([accountName],[accountEmail],[accountPaymentID],[PreviousOrderID]) VALUES ("j","j@gmail.com",10,10);
INSERT INTO account([accountName],[accountEmail],[accountPaymentID],[PreviousOrderID]) VALUES ("k","k@gmail.com",11,11);
INSERT INTO account([accountName],[accountEmail],[accountPaymentID],[PreviousOrderID]) VALUES ("l","l@gmail.com",12,12);

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [36]:
%%sql

SELECT * FROM account;

 * sqlite:///projectdb.db
Done.

[(1, 'a', 'a@gmail.com', 1, 1),
 (2, 'b', 'b@gmail.com', 2, 2),
 (3, 'c', 'c@gmail.com', 3, 3),
 (4, 'd', 'd@gmail.com', 4, 4),
 (5, 'e', 'e@gmail.com', 5, 5),
 (6, 'f', 'f@gmail.com', 6, 6),
 (7, 'g', 'g@gmail.com', 7, 7),
 (8, 'h', 'h@gmail.com', 8, 8),
 (9, 'i', 'i@gmail.com', 9, 9),
 (10, 'j', 'j@gmail.com', 10, 10),
 (11, 'k', 'k@gmail.com', 11, 11),
 (12, 'l', 'l@gmail.com', 12, 12)]

In [37]:
%%sql

INSERT INTO associate([email],[name]) VALUES ("m@gmail.com","m");
INSERT INTO associate([email],[name]) VALUES ("n@gmail.com","n");
INSERT INTO associate([email],[name]) VALUES ("o@gmail.com","o");
INSERT INTO associate([email],[name]) VALUES ("p@gmail.com","p");
INSERT INTO associate([email],[name]) VALUES ("q@gmail.com","q");
INSERT INTO associate([email],[name]) VALUES ("r@gmail.com","r");
INSERT INTO associate([email],[name]) VALUES ("s@gmail.com","s");

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [38]:
%%sql

SELECT * FROM associate

 * sqlite:///projectdb.db
Done.

[(1, 'm@gmail.com', 'm'),
 (2, 'n@gmail.com', 'n'),
 (3, 'o@gmail.com', 'o'),
 (4, 'p@gmail.com', 'p'),
 (5, 'q@gmail.com', 'q'),
 (6, 'r@gmail.com', 'r'),
 (7, 's@gmail.com', 's')]

In [39]:
%%sql

INSERT INTO CustomerService([csPhone],[csEmail],csAssociateID) Values ("111-111-1111","help@amazon.com",1);
INSERT INTO CustomerService([csPhone],[csEmail],csAssociateID) Values ("222-222-2222","help@amazon.com",2);
INSERT INTO CustomerService([csPhone],[csEmail],csAssociateID) Values ("333-333-3333","help@amazon.com",3);
INSERT INTO CustomerService([csPhone],[csEmail],csAssociateID) Values ("444-444-4444","help@amazon.com",4);
INSERT INTO CustomerService([csPhone],[csEmail],csAssociateID) Values ("555-555-5555","help@amazon.com",5);
INSERT INTO CustomerService([csPhone],[csEmail],csAssociateID) Values ("666-666-6666","help@amazon.com",6);
INSERT INTO CustomerService([csPhone],[csEmail],csAssociateID) Values ("777-777-7777","help@amazon.com",7);

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [40]:
%%sql

SELECT * FROM CustomerService

 * sqlite:///projectdb.db
Done.

[(1, '111-111-1111', 'help@amazon.com', 1),
 (2, '222-222-2222', 'help@amazon.com', 2),
 (3, '333-333-3333', 'help@amazon.com', 3),
 (4, '444-444-4444', 'help@amazon.com', 4),
 (5, '555-555-5555', 'help@amazon.com', 5),
 (6, '666-666-6666', 'help@amazon.com', 6),
 (7, '777-777-7777', 'help@amazon.com', 7)]

In [41]:
%%sql

INSERT INTO Amazon([HelpCenter],[Accessibility],[Prime],[CustomerServiceID]) VALUES ("1","1","1",1);
INSERT INTO Amazon([HelpCenter],[Accessibility],[Prime],[CustomerServiceID]) VALUES ("2","2","2",2);
INSERT INTO Amazon([HelpCenter],[Accessibility],[Prime],[CustomerServiceID]) VALUES ("3","3","3",3);
INSERT INTO Amazon([HelpCenter],[Accessibility],[Prime],[CustomerServiceID]) VALUES ("4","4","4",4);
INSERT INTO Amazon([HelpCenter],[Accessibility],[Prime],[CustomerServiceID]) VALUES ("5","5","5",5);
INSERT INTO Amazon([HelpCenter],[Accessibility],[Prime],[CustomerServiceID]) VALUES ("6","6","6",6);
INSERT INTO Amazon([HelpCenter],[Accessibility],[Prime],[CustomerServiceID]) VALUES ("7","7","7",7);
INSERT INTO Amazon([HelpCenter],[Accessibility],[Prime],[CustomerServiceID]) VALUES ("8","8","8",1);
INSERT INTO Amazon([HelpCenter],[Accessibility],[Prime],[CustomerServiceID]) VALUES ("9","9","9",3);
INSERT INTO Amazon([HelpCenter],[Accessibility],[Prime],[CustomerServiceID]) VALUES ("10","10","10",6);
INSERT INTO Amazon([HelpCenter],[Accessibility],[Prime],[CustomerServiceID]) VALUES ("11","11","11",4);
INSERT INTO Amazon([HelpCenter],[Accessibility],[Prime],[CustomerServiceID]) VALUES ("12","12","12",7);

 * sqlite:///projectdb.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [42]:
%%sql

SELECT * FROM Amazon;

 * sqlite:///projectdb.db
Done.

[('1', '1', '1', 1),
 ('2', '2', '2', 2),
 ('3', '3', '3', 3),
 ('4', '4', '4', 4),
 ('5', '5', '5', 5),
 ('6', '6', '6', 6),
 ('7', '7', '7', 7),
 ('8', '8', '8', 1),
 ('9', '9', '9', 3),
 ('10', '10', '10', 6),
 ('11', '11', '11', 4),
 ('12', '12', '12', 7)]

In [43]:
%%sql

UPDATE deals
SET [start] = date()
WHERE [itemID] = 1;

SELECT * FROM deals;

 * sqlite:///projectdb.db
1 rows affected.
Done.

[(1, 1, '2022-04-04', '2022-04-04', '20%'),
 (2, 2, '2022-04-04', '2022-04-04', '10%'),
 (3, 3, '2022-04-04', '2022-04-04', '5%'),
 (4, 4, '2022-04-04', '2022-04-04', '8%'),
 (5, 5, '2022-04-04', '2022-04-04', '12%'),
 (6, 6, '2022-04-04', '2022-04-04', '25%'),
 (7, 7, '2022-04-04', '2022-04-04', '50%'),
 (8, 8, '2022-04-04', '2022-04-04', '60%'),
 (9, 9, '2022-04-04', '2022-04-04', '15%'),
 (10, 10, '2022-04-04', '2022-04-04', '22%'),
 (11, 11, '2022-04-04', '2022-04-04', '30%'),
 (12, 12, '2022-04-04', '2022-04-04', '40%')]

In [44]:
%%sql

SELECT c.ID as ShoppingCartID
  ,i.ID as ItemID
  ,i.Item as ItemName
  ,i.Price as Price
  ,i.Stock as Inventory
  ,s.ID as SystemID
  ,s.System as RequiredSystem
  FROM cart c
  LEFT JOIN item i ON c.itemID = i.ID
  LEFT JOIN system s ON c.systemID = s.ID

 * sqlite:///projectdb.db
Done.

[(1, 1, 'Headset', 149.95, 20, 1, 'PlayStation 5'),
 (2, 2, 'Controller', 74.0, 43, 1, 'PlayStation 5'),
 (3, 3, 'PlayStation 4 Console', 199.99, 112, 2, 'PlayStation 4'),
 (4, 4, 'Game Disk', 39.95, 4, 2, 'PlayStation 4'),
 (5, 5, 'Currency Card', 29.95, 93, 3, 'Xbox Series X & S'),
 (6, 6, 'Charging Cable', 9.99, 254, 3, 'Xbox Series X & S'),
 (7, 7, 'Driving Wheel', 279.03, 2, 4, 'Xbox One'),
 (8, 8, 'Controller Charging Station', 22.99, 31, 4, 'Xbox One'),
 (9, 9, 'EShop Gift Card', 5.0, 55, 5, 'Nintendo Switch'),
 (10, 10, 'Pro Controller', 69.99, 77, 5, 'Nintendo Switch'),
 (11, 11, 'Keyboard', 138.99, 1, 6, 'PC'),
 (12, 12, 'Mouse', 11.89, 13, 6, 'PC')]

In [45]:
%%sql

SELECT Item
FROM item
WHERE Stock < 100

EXCEPT

SELECT Item
FROM item
WHERE Stock < 10;

 * sqlite:///projectdb.db
Done.

[('Apple Keyboard',),
 ('Controller',),
 ('Controller Charging Station',),
 ('Currency Card',),
 ('EShop Gift Card',),
 ('External Port Adapter',),
 ('Headset',),
 ('Mouse',),
 ('PlayStation 3 Console',),
 ('PlayStation Store Credit',),
 ('Pro Controller',),
 ('Universal TV Remote',),
 ('Xbox 360 Controller',)]

In [46]:
%%sql

DROP VIEW IF EXISTS vwItemSummary;
CREATE VIEW IF NOT EXISTS vwItemSummary
AS
SELECT i.ID AS itemID
  ,i.item as ItemName
  ,'$' || (i.price) AS Price
  ,i.Stock as RemainingStock
  ,s.System as GamingSystem
  FROM item i
  INNER JOIN system s ON i.systemID = s.ID;

 * sqlite:///projectdb.db
Done.
Done.

[]

In [47]:
%%sql

SELECT * FROM vwItemSummary;

 * sqlite:///projectdb.db
Done.

[(1, 'Headset', '$149.95', 20, 'PlayStation 5'),
 (2, 'Controller', '$74.0', 43, 'PlayStation 5'),
 (3, 'PlayStation 4 Console', '$199.99', 112, 'PlayStation 4'),
 (4, 'Game Disk', '$39.95', 4, 'PlayStation 4'),
 (5, 'Currency Card', '$29.95', 93, 'Xbox Series X & S'),
 (6, 'Charging Cable', '$9.99', 254, 'Xbox Series X & S'),
 (7, 'Driving Wheel', '$279.03', 2, 'Xbox One'),
 (8, 'Controller Charging Station', '$22.99', 31, 'Xbox One'),
 (9, 'EShop Gift Card', '$5.0', 55, 'Nintendo Switch'),
 (10, 'Pro Controller', '$69.99', 77, 'Nintendo Switch'),
 (11, 'Keyboard', '$138.99', 1, 'PC'),
 (12, 'Mouse', '$11.89', 13, 'PC'),
 (13, 'Apple Keyboard', '$129.99', 43, 'Mac'),
 (14, 'External Port Adapter', '$55.99', 92, 'Mac'),
 (15, 'Xbox 360 Controller', '$29.99', 14, 'Legacy Systems'),
 (16, 'PlayStation 3 Console', '$99.99', 24, 'Legacy Systems'),
 (17, 'PlayStation Store Credit', '$75.0', 69, 'Online Gaming Services'),
 (18, 'Universal TV Remote', '$13.98', 81, 'Microconsoles'),
 (19, 'Virtual Reality Headset', '$399.99', 6, 'Virtual Reality')]

In [49]:
%%sql

WITH StockUnder100 
AS
(
    SELECT ItemName
    FROM vwItemSummary
    WHERE GamingSystem LIKE '%PlayStation%' AND RemainingStock <= 100  
),
StockOver20 AS
(
    SELECT vwi.ItemName
    FROM vwItemSummary vwi
    JOIN StockUnder100 su ON vwi.ItemName = su.ItemName
    WHERE vwi.GamingSystem LIKE '%PlayStation%' AND vwi.RemainingStock >= 20 
)

SELECT *
FROM StockOver20

 * sqlite:///projectdb.db
Done.

[('Headset',), ('Controller',)]

In [50]:
%%sql

SELECT accountName, accountEmail, 'Customer' as Type
FROM account

UNION

SELECT name, email, 'Employee'
FROM associate;

 * sqlite:///projectdb.db
Done.

[('a', 'a@gmail.com', 'Customer'),
 ('b', 'b@gmail.com', 'Customer'),
 ('c', 'c@gmail.com', 'Customer'),
 ('d', 'd@gmail.com', 'Customer'),
 ('e', 'e@gmail.com', 'Customer'),
 ('f', 'f@gmail.com', 'Customer'),
 ('g', 'g@gmail.com', 'Customer'),
 ('h', 'h@gmail.com', 'Customer'),
 ('i', 'i@gmail.com', 'Customer'),
 ('j', 'j@gmail.com', 'Customer'),
 ('k', 'k@gmail.com', 'Customer'),
 ('l', 'l@gmail.com', 'Customer'),
 ('m', 'm@gmail.com', 'Employee'),
 ('n', 'n@gmail.com', 'Employee'),
 ('o', 'o@gmail.com', 'Employee'),
 ('p', 'p@gmail.com', 'Employee'),
 ('q', 'q@gmail.com', 'Employee'),
 ('r', 'r@gmail.com', 'Employee'),
 ('s', 's@gmail.com', 'Employee')]

In [51]:
%%sql 

SELECT DISTINCT Item, Price
FROM item;

 * sqlite:///projectdb.db
Done.

[('Headset', 149.95),
 ('Controller', 74.0),
 ('PlayStation 4 Console', 199.99),
 ('Game Disk', 39.95),
 ('Currency Card', 29.95),
 ('Charging Cable', 9.99),
 ('Driving Wheel', 279.03),
 ('Controller Charging Station', 22.99),
 ('EShop Gift Card', 5.0),
 ('Pro Controller', 69.99),
 ('Keyboard', 138.99),
 ('Mouse', 11.89),
 ('Apple Keyboard', 129.99),
 ('External Port Adapter', 55.99),
 ('Xbox 360 Controller', 29.99),
 ('PlayStation 3 Console', 99.99),
 ('PlayStation Store Credit', 75.0),
 ('Universal TV Remote', 13.98),
 ('Virtual Reality Headset', 399.99)]

In [52]:
%%sql

SELECT DISTINCT Item
FROM item
WHERE Item LIKE '%PlayStation%' OR Item LIKE '%Controller%';

 * sqlite:///projectdb.db
Done.

[('Controller',),
 ('PlayStation 4 Console',),
 ('Controller Charging Station',),
 ('Pro Controller',),
 ('Xbox 360 Controller',),
 ('PlayStation 3 Console',),
 ('PlayStation Store Credit',)]

In [53]:
%%sql

SELECT *
FROM account a
LEFT JOIN payment p ON a.accountPaymentID = p.ID;

 * sqlite:///projectdb.db
Done.

[(1, 'a', 'a@gmail.com', 1, 1, 1, 'Bill', '111111111111', '01/22', '111'),
 (2, 'b', 'b@gmail.com', 2, 2, 2, 'Will', '222222222222', '02/22', '222'),
 (3, 'c', 'c@gmail.com', 3, 3, 3, 'Jill', '333333333333', '03/22', '333'),
 (4, 'd', 'd@gmail.com', 4, 4, 4, 'William', '444444444444', '04/22', '444'),
 (5, 'e', 'e@gmail.com', 5, 5, 5, 'Dale', '555555555555', '05/22', '555'),
 (6, 'f', 'f@gmail.com', 6, 6, 6, 'Bale', '666666666666', '06/22', '666'),
 (7, 'g', 'g@gmail.com', 7, 7, 7, 'Jim', '777777777777', '07/22', '777'),
 (8, 'h', 'h@gmail.com', 8, 8, 8, 'Dave', '888888888888', '08/22', '888'),
 (9, 'i', 'i@gmail.com', 9, 9, 9, 'Katy', '999999999999', '09/22', '999'),
 (10, 'j', 'j@gmail.com', 10, 10, 10, 'Zoey', '101010101010', '10/22', '101'),
 (11, 'k', 'k@gmail.com', 11, 11, 11, 'Cole', '110110110110', '11/22', '112'),
 (12, 'l', 'l@gmail.com', 12, 12, 12, 'Chloe', '121212121212', '12/22', '121')]

In [54]:
%%sql

DROP VIEW IF EXISTS vwVisitorOrderSummary;
CREATE VIEW IF NOT EXISTS vwVisitorOrderSummary
AS
SELECT v.ID as VisitorID
  ,vis.status as VisitorStatus
  ,c.ID as ShoppingCartID
  ,i.ID as ItemID
  ,(i.Item) || ':  $' || (i.Price) || ' - ' || (s.System) as ItemSummary
  ,i.Stock as Inventory
  FROM visitor v
  INNER JOIN item i ON c.itemID = i.ID
  INNER JOIN system s ON i.systemID = s.ID
  INNER JOIN cart c ON v.cartID = c.ID
  INNER JOIN VisitorStatus vis ON v.VisitorStatusID = vis.ID
  ;

 * sqlite:///projectdb.db
Done.
Done.

[]

In [56]:
%%sql

SELECT * FROM vwVisitorOrderSummary;

 * sqlite:///projectdb.db
Done.

[(1, 'Member', 1, 1, 'Headset:  $149.95 - PlayStation 5', 20),
 (2, 'Member', 2, 2, 'Controller:  $74.0 - PlayStation 5', 43),
 (3, 'Visitor', 3, 3, 'PlayStation 4 Console:  $199.99 - PlayStation 4', 112),
 (4, 'Member', 4, 4, 'Game Disk:  $39.95 - PlayStation 4', 4),
 (5, 'Visitor', 5, 5, 'Currency Card:  $29.95 - Xbox Series X & S', 93),
 (6, 'Visitor', 6, 6, 'Charging Cable:  $9.99 - Xbox Series X & S', 254),
 (7, 'Visitor', 7, 7, 'Driving Wheel:  $279.03 - Xbox One', 2),
 (8, 'Member', 8, 8, 'Controller Charging Station:  $22.99 - Xbox One', 31),
 (9, 'Member', 9, 9, 'EShop Gift Card:  $5.0 - Nintendo Switch', 55),
 (10, 'Visitor', 10, 10, 'Pro Controller:  $69.99 - Nintendo Switch', 77),
 (11, 'Member', 11, 11, 'Keyboard:  $138.99 - PC', 1),
 (12, 'Visitor', 12, 12, 'Mouse:  $11.89 - PC', 13)]

In [57]:
%%sql

DROP VIEW IF EXISTS vwInventorySummary;
CREATE VIEW IF NOT EXISTS vwInventorySummary
AS
SELECT item, CASE WHEN Stock < 10 THEN '[Low Stock]'
            WHEN Stock BETWEEN 10 AND 50 THEN '[Less Than 50 Left]'
            WHEN Stock BETWEEN 50 AND 100 THEN '[Under 100 Left]'
            WHEN Stock BETWEEN 100 AND 200 THEN '[200-100 Left]'
            WHEN Stock >= 200 THEN 'Over 200 Left'
            END As InventoryCategories
            ,Stock
FROM item
;

 * sqlite:///projectdb.db
Done.
Done.

[]

In [58]:
%%sql

SELECT * FROM vwInventorySummary;

 * sqlite:///projectdb.db
Done.

[('Headset', '[Less Than 50 Left]', 20),
 ('Controller', '[Less Than 50 Left]', 43),
 ('PlayStation 4 Console', '[200-100 Left]', 112),
 ('Game Disk', '[Low Stock]', 4),
 ('Currency Card', '[Under 100 Left]', 93),
 ('Charging Cable', 'Over 200 Left', 254),
 ('Driving Wheel', '[Low Stock]', 2),
 ('Controller Charging Station', '[Less Than 50 Left]', 31),
 ('EShop Gift Card', '[Under 100 Left]', 55),
 ('Pro Controller', '[Under 100 Left]', 77),
 ('Keyboard', '[Low Stock]', 1),
 ('Mouse', '[Less Than 50 Left]', 13),
 ('Apple Keyboard', '[Less Than 50 Left]', 43),
 ('External Port Adapter', '[Under 100 Left]', 92),
 ('Xbox 360 Controller', '[Less Than 50 Left]', 14),
 ('PlayStation 3 Console', '[Less Than 50 Left]', 24),
 ('PlayStation Store Credit', '[Under 100 Left]', 69),
 ('Universal TV Remote', '[Under 100 Left]', 81),
 ('Virtual Reality Headset', '[Low Stock]', 6)]

In [59]:
%%sql

UPDATE item
SET [Stock] = 27
WHERE ID = 7;

 * sqlite:///projectdb.db
1 rows affected.

[]

In [60]:
%%sql

SELECT * FROM vwInventorySummary;

 * sqlite:///projectdb.db
Done.

[('Headset', '[Less Than 50 Left]', 20),
 ('Controller', '[Less Than 50 Left]', 43),
 ('PlayStation 4 Console', '[200-100 Left]', 112),
 ('Game Disk', '[Low Stock]', 4),
 ('Currency Card', '[Under 100 Left]', 93),
 ('Charging Cable', 'Over 200 Left', 254),
 ('Driving Wheel', '[Less Than 50 Left]', 27),
 ('Controller Charging Station', '[Less Than 50 Left]', 31),
 ('EShop Gift Card', '[Under 100 Left]', 55),
 ('Pro Controller', '[Under 100 Left]', 77),
 ('Keyboard', '[Low Stock]', 1),
 ('Mouse', '[Less Than 50 Left]', 13),
 ('Apple Keyboard', '[Less Than 50 Left]', 43),
 ('External Port Adapter', '[Under 100 Left]', 92),
 ('Xbox 360 Controller', '[Less Than 50 Left]', 14),
 ('PlayStation 3 Console', '[Less Than 50 Left]', 24),
 ('PlayStation Store Credit', '[Under 100 Left]', 69),
 ('Universal TV Remote', '[Under 100 Left]', 81),
 ('Virtual Reality Headset', '[Low Stock]', 6)]

In [61]:
%%sql

SELECT COUNT(1) As Matches
FROM item
WHERE Item NOT LIKE '%PlayStation%' AND Stock >=30
AND Item NOT IN (
    SELECT Item
    FROM item
    WHERE Item LIKE '%PlayStation%' AND Stock <=100
)

 * sqlite:///projectdb.db
Done.

[(9,)]

In [62]:
%%sql

SELECT COUNT(1) AS No_Of_Visitors
FROM vwVisitorOrderSummary

 * sqlite:///projectdb.db
Done.

[(12,)]

In [63]:
%%sql

SELECT *
FROM vwVisitorOrderSummary
WHERE Inventory BETWEEN 30.00 AND 100.00;

 * sqlite:///projectdb.db
Done.

[(2, 'Member', 2, 2, 'Controller:  $74.0 - PlayStation 5', 43),
 (5, 'Visitor', 5, 5, 'Currency Card:  $29.95 - Xbox Series X & S', 93),
 (8, 'Member', 8, 8, 'Controller Charging Station:  $22.99 - Xbox One', 31),
 (9, 'Member', 9, 9, 'EShop Gift Card:  $5.0 - Nintendo Switch', 55),
 (10, 'Visitor', 10, 10, 'Pro Controller:  $69.99 - Nintendo Switch', 77)]

In [64]:
%%sql

SELECT * FROM vwVisitorOrderSummary
WHERE VisitorStatus IN ('Member');

 * sqlite:///projectdb.db
Done.

[(1, 'Member', 1, 1, 'Headset:  $149.95 - PlayStation 5', 20),
 (2, 'Member', 2, 2, 'Controller:  $74.0 - PlayStation 5', 43),
 (4, 'Member', 4, 4, 'Game Disk:  $39.95 - PlayStation 4', 4),
 (8, 'Member', 8, 8, 'Controller Charging Station:  $22.99 - Xbox One', 31),
 (9, 'Member', 9, 9, 'EShop Gift Card:  $5.0 - Nintendo Switch', 55),
 (11, 'Member', 11, 11, 'Keyboard:  $138.99 - PC', 1)]

In [65]:
%%sql

DROP VIEW IF EXISTS vwAccountSummary;
CREATE VIEW IF NOT EXISTS vwAccountSummary
AS
SELECT a.ID AS AccountID
  ,a.accountName AS UserName
  ,a.accountEmail AS Email
  ,p.ID AS PaymentID
  ,p.cardName AS CardHolder
  ,p.cardNumber AS cardNumber
  ,p.cardCSV AS CSVNumber
  ,prev.item1ID as PreviouslyOrderedItem
  FROM account a
  INNER JOIN payment p ON a.accountPaymentID = p.ID
  LEFT JOIN PreviousOrder prev ON a.PreviousOrderID = prev.ID

 * sqlite:///projectdb.db
Done.
Done.

[]

In [66]:
%%sql

SELECT * FROM vwAccountSummary;

 * sqlite:///projectdb.db
Done.

[(1, 'a', 'a@gmail.com', 1, 'Bill', '111111111111', '111', 1),
 (2, 'b', 'b@gmail.com', 2, 'Will', '222222222222', '222', 2),
 (3, 'c', 'c@gmail.com', 3, 'Jill', '333333333333', '333', 3),
 (4, 'd', 'd@gmail.com', 4, 'William', '444444444444', '444', 4),
 (5, 'e', 'e@gmail.com', 5, 'Dale', '555555555555', '555', 5),
 (6, 'f', 'f@gmail.com', 6, 'Bale', '666666666666', '666', 6),
 (7, 'g', 'g@gmail.com', 7, 'Jim', '777777777777', '777', 7),
 (8, 'h', 'h@gmail.com', 8, 'Dave', '888888888888', '888', 8),
 (9, 'i', 'i@gmail.com', 9, 'Katy', '999999999999', '999', 9),
 (10, 'j', 'j@gmail.com', 10, 'Zoey', '101010101010', '101', 10),
 (11, 'k', 'k@gmail.com', 11, 'Cole', '110110110110', '112', 11),
 (12, 'l', 'l@gmail.com', 12, 'Chloe', '121212121212', '121', 12)]